python -m pip install plotly

In [4]:
import plotly
print(plotly.__version__)

5.24.1

python -m pip install nbformat

In [5]:
import nbformat
print(nbformat.__version__)

5.10.4

# Bar plot

In [6]:
import plotly.io as pio
pio.renderers.default = "browser"

In [7]:
import plotly.express as px
import pandas as pd
df=pd.read_csv(r"C:\Users\user\Downloads\Iris.csv")
print(df.head())

px.bar(df,x='Species',color="Species")

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

if we want to add difrent color

In [8]:
px.bar(df,x='Species',color="Species",color_discrete_sequence=["red","green","blue"])

size of species

In [9]:
data=df.groupby(["Species"]).size().rename("count").reset_index()
data.head()

           Species  count
0      Iris-setosa     50
1  Iris-versicolor     50
2   Iris-virginica     50

In [10]:
px.bar(data,x='Species',y='count',color="Species",text="count")

# Some datasets under plotly

px.data.iris()


px.data.penguins()


px.data.gapminder()


px.data.carshare()



px.data.wine()


px.data.tips()


px.data.election()


px.data.wind()

In [11]:
px.data.gapminder()

,country,continent,year,lifeExp,pop,gdpPercap,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.351,9216418,706.157306,ZWE,716
1700,Zimbabwe,Africa,1992,60.377,10704340,693.420786,ZWE,716
1701,Zimbabwe,Africa,1997,46.809,11404948,792.449960,ZWE,716
1702,Zimbabwe,Africa,2002,39.989,11926563,672.038623,ZWE,716
1703,Zimbabwe,Africa,2007,43.487,12311143,469.709298,ZWE,716

In [12]:
data_canada=px.data.gapminder().query("country=='Canada'")
data_canada

    country continent  year  lifeExp       pop    gdpPercap iso_alpha  iso_num
240  Canada  Americas  1952   68.750  14785584  11367.16112       CAN      124
241  Canada  Americas  1957   69.960  17010154  12489.95006       CAN      124
242  Canada  Americas  1962   71.300  18985849  13462.48555       CAN      124
243  Canada  Americas  1967   72.130  20819767  16076.58803       CAN      124
244  Canada  Americas  1972   72.880  22284500  18970.57086       CAN      124
245  Canada  Americas  1977   74.210  23796400  22090.88306       CAN      124
246  Canada  Americas  1982   75.760  25201900  22898.79214       CAN      124
247  Canada  Americas  1987   76.860  26549700  26626.51503       CAN      124
248  Canada  Americas  1992   77.950  28523502  26342.88426       CAN      124
249  Canada  Americas  1997   78.610  30305843  28954.92589       CAN      124
250  Canada  Americas  2002   79.770  31902268  33328.96507       CAN      124
251  Canada  Americas  2007   80.653  33390141  36319.23501       CAN      124

In [13]:
px.bar(data_canada,x="year",y="pop")

In [14]:
px.bar(data_canada,x="year",y="pop",text="year")

In [15]:
px.bar(data_canada,x="year",y="pop",hover_data=["lifeExp","gdpPercap"],color="lifeExp",labels={"pop:":"population of canada"},height=400)

In [16]:
px.data.medals_long()

        nation   medal  count
0  South Korea    gold     24
1        China    gold     10
2       Canada    gold      9
3  South Korea  silver     13
4        China  silver     15
5       Canada  silver     12
6  South Korea  bronze     11
7        China  bronze      8
8       Canada  bronze     12

In [21]:
long_data=px.data.medals_long()
long_data.head()

        nation   medal  count
0  South Korea    gold     24
1        China    gold     10
2       Canada    gold      9
3  South Korea  silver     13
4        China  silver     15

In [ ]:
px.bar(long_data,x="nation",y="count",color="medal")

In [24]:
wide_data=px.data.medals_wide()
wide_data

        nation  gold  silver  bronze
0  South Korea    24      13      11
1        China    10      15       8
2       Canada     9      12      12

In [30]:
px.bar(wide_data,x="nation",y=["gold","silver","bronze"])

In [31]:
long_data

        nation   medal  count
0  South Korea    gold     24
1        China    gold     10
2       Canada    gold      9
3  South Korea  silver     13
4        China  silver     15
5       Canada  silver     12
6  South Korea  bronze     11
7        China  bronze      8
8       Canada  bronze     12

In [33]:
px.bar(long_data,x="medal",y="count",color="nation",pattern_shape_sequence=[".","x","+"])